app/Restorant.php

    public function getPlanAttribute(){
        $planInfo=[
            'plan'=>null,
            "canMakeNewOrder"=>false,
            "canAddNewItems"=>false,
            "itemsMessage"=>"",
            "itemsAlertType"=>"success",
            "ordersMessage"=>"",
            "ordersAlertType"=>"success"
        ];

        //Find the plan
        $currentPlan = Plans::withTrashed()->find($this->user->mplanid());
        if($currentPlan==null){
            //Make artificial plan - usefull when migrating the system  - or wrong free plan id
            $currentPlan=new Plans();
            $currentPlan->name =__('No plan found');
            $currentPlan->price = 0;
            $currentPlan->limit_items = 0;
            $currentPlan->enable_ordering = 1;
            $currentPlan->limit_orders = 0;
            $currentPlan->period=1;
        }
        $planInfo['plan']=$currentPlan->toArray();


        //Count items
        $itemsCount = Items::whereIn('category_id', $this->categories->pluck('id')->toArray())->whereNull('deleted_at')->count();
---
select * from `plan` where `plan`.`id` = 3 limit 1
select * from `users` where `users`.`id` = 35 and `users`.`deleted_at` is null limit 1
select count(*) as aggregate from `items` where `category_id` in (69, 70) and `deleted_at` is null and `items`.`deleted_at` is null

    public function getBusinessHours(){

        $creationArray=[
            'monday'     => [],
            'tuesday'    => [],
            'wednesday'  => [],
            'thursday'   => [],
            'friday'     => [],
            'saturday'   => [],
            'sunday'     => [],
            'overflow' => true
        ];

        $dayKeys=array_keys($creationArray);

        //Get all working hours
        $workingHours=$this->hours()->get()->toArray();
---
select * from `hours` where `hours`.`restorant_id` = 17 and `hours`.`restorant_id` is not null

    public static function boot()
    {
        parent::boot();
        self::deleting(function (self $restaurant) {
            if (config('settings.is_demo')) {
                return false; //In demo disable deleting
            } else {
                //Delete orders
                foreach ($restaurant->orders()->get() as $order) {
                    $order->delete();
                }

                return true;
            }
        });
---
select * from `orders` where `orders`.`restorant_id` = 12 and `orders`.`restorant_id` is not null and `orders`.`deleted_at` is null