app/Repositories/Orders/BaseOrderRepository.php

    private function createOrder()
    {
        if ($this->order == null) {
            $this->order = new Order;
            $this->order->restorant_id = $this->vendor ? $this->vendor->id : null;
            $this->order->comment = "";
            $this->order->payment_method = $this->request->payment_method;
            $this->order->payment_status = "unpaid";

            $expeditionsTypes = ['delivery' => 1, 'pickup' => 2, 'dinein' => 3]; //1- delivery 2 - pickup 3-dinein
            $this->order->delivery_method = $expeditionsTypes[$this->expedition];

            //Client
            if (auth()->user()) {
                $this->order->client_id = auth()->user()->id;
            }

            $this->order->order_price = 0;
            $this->order->vatvalue = 0;

            //Save order
            $this->order->save();
---
insert into `orders` (`restorant_id`, `comment`, `payment_method`, `payment_status`, `delivery_method`, `client_id`, `order_price`, `vatvalue`, `updated_at`, `created_at`) values (17, '', 'cod', 'unpaid', 3, 35, 0, 0, '2022-07-24 09:13:34', '2022-07-24 09:13:34')

            //Total vat on this item
            $totalCalculatedVAT = $item['qty'] * ($theItem->vat > 0 ? $itemSelectedPrice * ($theItem->vat / 100) : 0);

            $this->order->items()->attach($item['id'], [
                'qty' => $item['qty'],
                'extras' => json_encode($extras),
                'vat' => $theItem->vat,
                'vatvalue' => $totalCalculatedVAT,
                'variant_name' => $variantName,
                'variant_price' => $itemSelectedPrice
            ]);
---
select `items`.*, `order_has_items`.`order_id` as `pivot_order_id`, `order_has_items`.`item_id` as `pivot_item_id`, `order_has_items`.`qty` as `pivot_qty`, `order_has_items`.`extras` as `pivot_extras`, `order_has_items`.`vat` as `pivot_vat`, `order_has_items`.`vatvalue` as `pivot_vatvalue`, `order_has_items`.`variant_price` as `pivot_variant_price`, `order_has_items`.`variant_name` as `pivot_variant_name`, `order_has_items`.`id` as `pivot_id` from `items` inner join `order_has_items` on `items`.`id` = `order_has_items`.`item_id` where `order_has_items`.`order_id` = 605



        //Update the order with the item
        $this->order->update();
---
update `orders` set `order_price` = 123263, `orders`.`updated_at` = '2022-07-22 10:06:33' where `id` = 605

    private function setComment()
    {

        $comment = $this->request->comment ? strip_tags($this->request->comment . '') : '';
        $this->order->comment = $this->order->comment . ' ' . $comment;
        $this->order->update();
---
update `orders` set `comment` = ' mai repede', `orders`.`updated_at` = '2022-07-22 10:06:33' where `id` = 605

    private function calculateFees()
    {
        if ($this->vendor) {
            $this->order->static_fee = $this->vendor->static_fee;
            $this->order->fee = $this->vendor->fee;
            $this->order->fee_value = ($this->vendor->fee / 100) * ($this->order->order_price_with_discount - $this->vendor->static_fee);
            $this->order->update();
---
update `orders` set `static_fee` = 0, `fee` = 0, `fee_value` = 0, `orders`.`updated_at` = '2022-07-22 10:06:33' where `id` = 605