modules/Poscloud/Http/Controllers/Main.php

    public function moveOrder($tableFrom,$tableTo){
        $order=CartStorageModel::where('vendor_id',auth()->user()->restaurant_id)->where('id',$tableFrom."_cart_items")->first();
        if($order){
            $order->id=$tableTo."_cart_items";
            $order->update();
---
select * from `cart_storage` where `vendor_id` = 17 and `id` = '247_cart_items' limit 1
update `cart_storage` set `id` = '248_cart_items', `cart_storage`.`updated_at` = '2022-07-24 08:34:24' where `id` = '247_cart_items'

    public function orders(){

        \App\Services\ConfChanger::switchCurrency(Restorant::where('id', auth()->user()->restaurant_id)->first());

        //Get all the active orders
        $orders=CartStorageModel::where('vendor_id',auth()->user()->restaurant_id)->get();
---
select * from `cart_storage` where `vendor_id` = 17