app/Http/Controllers/FrontEndController.php

select * from `pages` where `showAsLink` = 1
---
            $featured_vendors = Restorant::where('active', 1)->where('is_featured', 1)->get()->shuffle();


            $response = new \Illuminate\Http\Response(view('qrsaas.' . config('settings.qr_landing'), [
                'col' => $colCounter[count($plans)],
                'plans' => $plans,
                'features' => $features,
                'availableLanguages' => $availableLanguages,
                'locale' => $locale,
                'pages' => Pages::where('showAsLink', 1)->get(),
                'featured_vendors' => $featured_vendors
            ]));

select * from `tables` where `restaurant_id` = 17
---
            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();