app/Http/Controllers/HomeController.php

        }
        if(auth()->user()->hasRole('owner')){
            if(auth()->user()->restorant&&auth()->user()->restorant->categories){
                $countItems=Items::whereIn('category_id', auth()->user()->restorant->categories->pluck('id')->toArray())->whereNull('deleted_at')->count();
---
select count(*) as aggregate from `items` where `category_id` in (69, 70) and `deleted_at` is null and `items`.`deleted_at` is null