app/Http/Controllers/OrderController.php

    public function liveapi()
    {

        if (auth()->user()->hasRole('client')) {
            abort(404, 'Not allowed as client');
        }

        //Today only
        $orders = Order::where('created_at', '>=', Carbon::today())->orderBy('created_at', 'desc');

        //If owner, only from his restorant
        if (auth()->user()->hasRole('owner') || auth()->user()->hasRole('staff')) {
            $resto = auth()->user()->restorant;

            $orders = $orders->where(['restorant_id' => $resto->id]);

            //Change currency
            ConfChanger::switchCurrency($resto);

            //Set config based on restaurant
            config(['app.timezone' => $resto->getConfig('time_zone', config('app.timezone'))]);

            //Change language
            //ConfChanger::switchLanguage($order->restorant);
        }

        $orders = $orders->with(['status', 'client', 'restorant', 'table.restoarea'])
            ->whereHas('table.restoarea', function ($query) {
                $query->where('user_id', auth()->user()->id);
            })
            ->get()->toArray();
---
select * from `orders` where `created_at` >= '2022-07-24 00:00:00' and (`restorant_id` = 17) and `orders`.`deleted_at` is null and `restorant_id` = 17 order by `created_at` desc
select * from `restoareas` where `restoareas`.`id` in (35)
select * from `tables` where `tables`.`id` in ('', 242, 245, 246, 247, 248)
select * from `users` where `users`.`id` in ('', 1, 35) and `users`.`deleted_at` is null